; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_3 ?v2 - type_1 ?v5 - type_2)
 	      (pred_1 ?v7 - object ?v5 - type_2)
	      (pred_4 ?v2 - type_1 ?v1 - type_3)
	      (pred_2 ?v2 - type_1 ?v7 - object ?v1 - type_3))

   (:action op_1
       :parameters  (?v2 - type_1 ?v6 ?v4 - type_2)
       :precondition (and  (pred_3 ?v2 ?v6))
       :effect (and  (pred_3 ?v2 ?v4)
		     (not (pred_3 ?v2 ?v6))))

   (:action op_2
       :parameters (?v2 - type_1 ?v3 - object ?v8 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_1 ?v3 ?v8) (pred_3 ?v2 ?v8) (pred_4 ?v2 ?v1))
       :effect (and (pred_2 ?v2 ?v3 ?v1)
		    (not (pred_1 ?v3 ?v8)) 
		    (not (pred_4 ?v2 ?v1))))

   (:action op_3
       :parameters (?v2 - type_1 ?v3 - object ?v8 - type_2 ?v1 - type_3)
       :precondition  (and  (pred_2 ?v2 ?v3 ?v1) (pred_3 ?v2 ?v8))
       :effect (and (pred_1 ?v3 ?v8)
		    (pred_4 ?v2 ?v1)
		    (not (pred_2 ?v2 ?v3 ?v1)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_06 - type_1
obj_08 obj_03 - type_3
obj_04 obj_09 obj_05 - type_2
obj_02 obj_01 obj_07 - object)
(:init
(pred_3 obj_06 obj_04)
(pred_4 obj_06 obj_08)
(pred_4 obj_06 obj_03)
(pred_1 obj_02 obj_05)
(pred_1 obj_01 obj_09)
(pred_1 obj_07 obj_09)
)
(:goal
(and
(pred_1 obj_02 obj_04)
(pred_1 obj_01 obj_04)
(pred_1 obj_07 obj_04)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_2 obj_06 ?b obj_03))))
)
)

; plan
1. (op_1 obj_06 obj_04 obj_09)
   deleted: (pred_3 obj_06 obj_04)
   added: (pred_3 obj_06 obj_09)
   goals met: 0 of 3
2. (op_2 obj_06 obj_01 obj_09 obj_08)
   deleted: (pred_1 obj_01 obj_09) (pred_4 obj_06 obj_08)
   added: (pred_2 obj_06 obj_01 obj_08)
   goals met: 0 of 3
3. (op_1 obj_06 obj_09 obj_04)
   deleted: (pred_3 obj_06 obj_09)
   added: (pred_3 obj_06 obj_04)
   goals met: 0 of 3
4. (op_3 obj_06 obj_01 obj_04 obj_08)
   deleted: (pred_2 obj_06 obj_01 obj_08)
   added: (pred_1 obj_01 obj_04) (pred_4 obj_06 obj_08)
   goals met: 1 of 3
5. (op_1 obj_06 obj_04 obj_05)
   deleted: (pred_3 obj_06 obj_04)
   added: (pred_3 obj_06 obj_05)
   goals met: 1 of 3
6. (op_2 obj_06 obj_02 obj_05 obj_08)
   deleted: (pred_1 obj_02 obj_05) (pred_4 obj_06 obj_08)
   added: (pred_2 obj_06 obj_02 obj_08)
   goals met: 1 of 3
7. (op_1 obj_06 obj_05 obj_04)
   deleted: (pred_3 obj_06 obj_05)
   added: (pred_3 obj_06 obj_04)
   goals met: 1 of 3
8. (op_3 obj_06 obj_02 obj_04 obj_08)
   deleted: (pred_2 obj_06 obj_02 obj_08)
   added: (pred_1 obj_02 obj_04) (pred_4 obj_06 obj_08)
   goals met: 2 of 3
9. (op_1 obj_06 obj_04 obj_09)
   deleted: (pred_3 obj_06 obj_04)
   added: (pred_3 obj_06 obj_09)
   goals met: 2 of 3
10. (op_2 obj_06 obj_07 obj_09 obj_08)
   deleted: (pred_1 obj_07 obj_09) (pred_4 obj_06 obj_08)
   added: (pred_2 obj_06 obj_07 obj_08)
   goals met: 2 of 3
11. (op_1 obj_06 obj_09 obj_04)
   deleted: (pred_3 obj_06 obj_09)
   added: (pred_3 obj_06 obj_04)
   goals met: 2 of 3
12. (op_3 obj_06 obj_07 obj_04 obj_08)
   deleted: (pred_2 obj_06 obj_07 obj_08)
   added: (pred_1 obj_07 obj_04) (pred_4 obj_06 obj_08)
   goals met: 3 of 3
